{"byte_pairs": {"__sow": 3, "__eow": 4, "n": 5, "h": 6, "t": 7, "c": 8, "i": 9, "g": 10, "ng": 11, "m": 12, "a": 13, "u": 14, "\u0111": 15, "nh": 16, "\u00e0": 17, "\u01b0": 18, "o": 19, "ch": 20, "th": 21, "l": 22, "v": 23, "b": 24, "y": 25, "r": 26, "\u00e1": 27, "k": 28, "\u00f4": 29, "p": 30, "tr": 31, "s": 32, "\u1ebf": 33, "\u00f3": 34, "kh": 35, "\u1ea1": 36, "hi": 37, "\u1ea3": 38, "\u1edd": 39, "\u00ea": 40, "\u1ed9": 41, "\u00f4n": 42, "\u1ea5": 43, "d": 44, "\u00f4ng": 45, "\u1ec7": 46, "\u1ed1": 47, "ph": 48, "\u01a1": 49, "\u00ec": 50, "\u1edb": 51, "\u1ec1": 52, "an": 53, "\u00e2": 54, "\u00ean": 55, "l\u00e0": 56, "h\u01b0": 57, "\u01b0\u1edd": 58, "gi": 59, "\u1ec3": 60, "\u00e1c": 61, "\u1ee7": 62, "i\u1ec7": 63, "\u00e0n": 64, "\u1ee3": 65, "\u1eddi": 66, "\u1ead": 67, "ho": 68, "h\u00f4": 69, "q": 70, "qu": 71, "v\u00e0": 72, "\u1ea7": 73, "c\u00f3": 74, "x": 75, "h\u00f4n": 76, "\u1ecb": 77, "\u1eef": 78, "on": 79, "c\u00e1": 80, "i\u1ebf": 81, "\u00ed": 82, "\u1ecd": 83, "ha": 84, "e": 85, "\u00fa": 86, "\u1ed9t": 87, "hu": 88, "uy": 89, "kh\u00f4": 90, "m\u1ed9": 91, "\u0103": 92, "h\u00e0": 93, "\u0111\u01b0": 94, "m\u1ed9t": 95, "\u00ecn": 96, "\u00f4i": 97, "c\u1ee7": 98, "\u1ee9": 99, "\u1ee7a": 100, "c\u1ee7a": 101, "\u01b0\u1ee3": 102, "\u1eaf": 103, "\u1ea5t": 104, "\u01b0\u01a1": 105, "\u00e3": 106, "i\u1ec1": 107, "\u01b0\u1eddi": 108, "\u1ef1": 109, "\u1edbi": 110, "h\u00e1": 111, "\u00ecnh": 112, "\u1ed3": 113, "\u1ebfn": 114, "g\u01b0": 115, "\u1edf": 116, "h\u1eef": 117, "ti": 118, "ng\u01b0": 119, "\u1ea1n": 120, "\u00e0y": 121, "\u1ebft": 122, "\u1ec7n": 123, "nh\u01b0": 124, "\u0111i": 125, "\u1ea1i": 126, "c\u00e1c": 127, "g\u01b0\u1edd": 128, "\u1ed1n": 129, "\u1eefn": 130, "\u1eefng": 131, "\u01a1n": 132, "anh": 133, "\u1ec1u": 134, "h\u1eefn": 135, "\u01a1i": 136, "n\u00e0": 137, "nh\u1eef": 138, "t\u00f4": 139, "\u00e2n": 140, "i\u00ea": 141, "\u1ee5": 142, "\u1ee3c": 143, "\u01b0\u1ee3c": 144, "ai": 145, "\u00f2": 146, "\u00e1n": 147, "ong": 148, "t\u00f4i": 149, "\u0111\u01b0\u1ee3": 150, "ay": 151, "gh": 152, "vi": 153, "\u01b0\u1edb": 154, "\u00e0o": 155, "h\u00ed": 156, "cho": 157, "ra": 158, "h\u1ea3": 159, "i\u1ec1u": 160, "\u1ea3i": 161, "\u1eddn": 162, "in": 163, "\u1ea3n": 164, "\u01b0\u1eddn": 165, "\u0103n": 166, "ngh": 167, "nhi": 168, "\u0169": 169, "\u1ea7n": 170, "\u1eddng": 171, "m\u01b0": 172, "\u00f9": 173, "h\u1ea5": 174, "\u1eeb": 175, "i\u00ean": 176, "h\u1ecd": 177, "c\u00f4": 178, "ro": 179, "ao": 180, "ron": 181, "tro": 182, "hi\u1ec7": 183, "\u1eb7": 184, "h\u00ec": 185, "\u1ea5y": 186, "\u1ed5": 187, "\u00f2n": 188, "h\u00fa": 189, "ua": 190, "h\u00e0n": 191, "\u0111\u00e3": 192, "u\u1ed1": 193, "\u0169n": 194, "\u0169ng": 195, "n\u00e0y": 196, "h\u1ebf": 197, "\u00e0m": 198, "c\u0169": 199}, "words": {"__pad": 0, "__unk": 1, "__blank": 2}, "kwargs": {"vocab_size": 200, "pct_bpe": 1, "silent": true, "ngram_min": 2, "ngram_max": 3, "required_tokens": ["__pad", "__unk", "__blank"], "strict": false, "EOW": "__eow", "SOW": "__sow", "UNK": "__unk", "PAD": "__pad"}}