{
  "byte_pairs": {
    "__eow": 3,
    "__sow": 4,
    "n": 5,
    "h": 6,
    "t": 7,
    "c": 8,
    "i": 9,
    "g": 10,
    "ng": 11,
    "m": 12,
    "a": 13,
    "u": 14,
    "đ": 15,
    "nh": 16,
    "à": 17,
    "ư": 18,
    "o": 19,
    "ch": 20,
    "th": 21,
    "l": 22,
    "v": 23,
    "b": 24,
    "y": 25,
    "r": 26,
    "á": 27,
    "k": 28,
    "ô": 29,
    "p": 30,
    "tr": 31,
    "s": 32,
    "ế": 33,
    "ó": 34,
    "kh": 35,
    "ạ": 36,
    "hi": 37,
    "ả": 38,
    "ờ": 39,
    "ê": 40,
    "ộ": 41,
    "ôn": 42,
    "ấ": 43,
    "d": 44,
    "ệ": 45,
    "ố": 46,
    "ph": 47,
    "ơ": 48,
    "ì": 49,
    "ớ": 50,
    "ề": 51,
    "an": 52,
    "â": 53,
    "ên": 54,
    "là": 55,
    "hư": 56,
    "ườ": 57,
    "gi": 58,
    "ể": 59,
    "ác": 60,
    "ủ": 61,
    "iệ": 62,
    "àn": 63,
    "ợ": 64,
    "ời": 65,
    "ậ": 66,
    "ho": 67,
    "hô": 68,
    "q": 69,
    "qu": 70,
    "và": 71,
    "ầ": 72,
    "có": 73,
    "x": 74,
    "ị": 75,
    "ữ": 76,
    "on": 77,
    "cá": 78,
    "iế": 79,
    "í": 80,
    "ọ": 81,
    "ha": 82,
    "e": 83,
    "ú": 84,
    "ột": 85,
    "hu": 86,
    "uy": 87,
    "mộ": 88,
    "ă": 89,
    "hà": 90,
    "đư": 91,
    "ìn": 92,
    "ôi": 93,
    "củ": 94,
    "ứ": 95,
    "ủa": 96,
    "ượ": 97,
    "ắ": 98,
    "ất": 99,
    "ươ": 100,
    "ã": 101,
    "iề": 102,
    "ự": 103,
    "ới": 104,
    "há": 105,
    "ồ": 106,
    "ến": 107,
    "gư": 108,
    "ở": 109,
    "hữ": 110,
    "ti": 111,
    "ạn": 112,
    "ày": 113,
    "ết": 114,
    "ện": 115,
    "đi": 116,
    "ại": 117,
    "ốn": 118,
    "ữn": 119,
    "ơn": 120,
    "ều": 121,
    "ơi": 122,
    "nà": 123,
    "tô": 124,
    "ân": 125,
    "iê": 126,
    "ụ": 127,
    "ợc": 128,
    "ai": 129,
    "ò": 130,
    "án": 131,
    "ay": 132,
    "gh": 133,
    "vi": 134,
    "ướ": 135,
    "ào": 136,
    "hí": 137,
    "ra": 138,
    "hả": 139,
    "ải": 140,
    "ờn": 141,
    "in": 142,
    "ản": 143,
    "ăn": 144,
    "ũ": 145,
    "ần": 146,
    "mư": 147,
    "ù": 148,
    "hấ": 149,
    "ừ": 150,
    "họ": 151,
    "cô": 152,
    "ro": 153,
    "ao": 154,
    "ặ": 155,
    "hì": 156,
    "ấy": 157,
    "ổ": 158,
    "òn": 159,
    "hú": 160,
    "ua": 161,
    "đã": 162,
    "uố": 163,
    "ũn": 164,
    "hế": 165,
    "àm": 166,
    "cũ": 167,
    "ín": 168,
    "hậ": 169,
    "ỏ": 170,
    "bi": 171,
    "ớc": 172,
    "ây": 173,
    "để": 174,
    "bạ": 175,
    "cả": 176,
    "ba": 177,
    "vớ": 178,
    "ỉ": 179,
    "lạ": 180,
    "rư": 181,
    "ầu": 182,
    "ái": 183,
    "đó": 184,
    "ài": 185,
    "ẽ": 186,
    "hâ": 187,
    "sa": 188,
    "ia": 189,
    "ta": 190,
    "iể": 191,
    "ưn": 192,
    "ồn": 193,
    "co": 194,
    "é": 195,
    "mà": 196,
    "đế": 197,
    "ằ": 198,
    "ki": 199,
    "ền": 200,
    "au": 201,
    "ọc": 202,
    "ật": 203,
    "hể": 204,
    "ăm": 205,
    "em": 206,
    "nó": 207,
    "hứ": 208,
    "hơ": 209,
    "ức": 210,
    "ận": 211,
    "oà": 212,
    "gà": 213,
    "bả": 214,
    "về": 215,
    "ử": 216,
    "he": 217,
    "hỉ": 218,
    "ún": 219,
    "độ": 220,
    "sẽ": 221,
    "sá": 222,
    "tu": 223,
    "un": 224,
    "ằn": 225,
    "nă": 226,
    "ý": 227,
    "ối": 228,
    "hạ": 229,
    "ưa": 230,
    "ực": 231,
    "ẹ": 232,
    "mì": 233,
    "yê": 234,
    "hị": 235,
    "đầ": 236,
    "ệc": 237,
    "hó": 238,
    "ội": 239,
    "âu": 240,
    "số": 241,
    "át": 242,
    "đa": 243,
    "ẫ": 244,
    "ếu": 245,
    "ùn": 246,
    "bà": 247,
    "từ": 248,
    "bị": 249,
    "cò": 250,
    "ộn": 251,
    "ĩ": 252,
    "ồi": 253,
    "đâ": 254,
    "ỗ": 255,
    "áo": 256,
    "tư": 257,
    "iá": 258,
    "cầ": 259,
    "êu": 260,
    "ắt": 261,
    "bá": 262,
    "sự": 263,
    "tá": 264,
    "ục": 265,
    "ón": 266,
    "oạ": 267,
    "ọn": 268,
    "hủ": 269,
    "ẻ": 270,
    "tạ": 271,
    "hỏ": 272,
    "eo": 273,
    "ám": 274,
    "ệt": 275,
    "tì": 276,
    "úc": 277,
    "ẫn": 278,
    "ắn": 279,
    "cu": 280,
    "ói": 281,
    "ộc": 282,
    "nư": 283,
    "rê": 284,
    "ễ": 285,
    "hầ": 286,
    "ẩ": 287,
    "hờ": 288,
    "oa": 289,
    "uộ": 290,
    "đề": 291,
    "bố": 292,
    "xu": 293,
    "na": 294,
    "ốc": 295,
    "rấ": 296,
    "ập": 297,
    "yế": 298,
    "ển": 299,
    "ắc": 300,
    "vậ": 301,
    "mu": 302,
    "ổi": 303,
    "ốt": 304,
    "lư": 305,
    "đá": 306,
    "ạc": 307,
    "ru": 308,
    "lê": 309,
    "hắ": 310,
    "ớn": 311,
    "đồ": 312,
    "yệ": 313,
    "vì": 314,
    "ca": 315,
    "iả": 316,
    "uá": 317,
    "áu": 318,
    "mớ": 319,
    "hố": 320,
    "hồ": 321,
    "dâ": 322,
    "do": 323,
    "đị": 324,
    "ặt": 325,
    "ảm": 326,
    "nê": 327,
    "ừn": 328,
    "âm": 329,
    "lo": 330,
    "xe": 331,
    "ữa": 332,
    "lu": 333,
    "ấn": 334,
    "íc": 335,
    "si": 336,
    "cơ": 337,
    "ứn": 338,
    "gu": 339,
    "ảo": 340,
    "rồ": 341,
    "hộ": 342,
    "ảy": 343,
    "gì": 344,
    "ri": 345,
    "ịn": 346,
    "tố": 347,
    "vẫ": 348,
    "hụ": 349,
    "uậ": 350,
    "đạ": 351,
    "ạo": 352,
    "êm": 353,
    "go": 354,
    "è": 355,
    "ậy": 356,
    "câ": 357,
    "am": 358,
    "li": 359,
    "uô": 360,
    "tí": 361,
    "ỏi": 362,
    "đấ": 363,
    "to": 364,
    "ấp": 365,
    "má": 366,
    "ặc": 367,
    "nế": 368,
    "tâ": 369,
    "cứ": 370,
    "ạt": 371,
    "ợn": 372,
    "uả": 373,
    "ểm": 374,
    "hợ": 375,
    "hự": 376,
    "áp": 377,
    "ụn": 378,
    "rá": 379,
    "ma": 380,
    "ưở": 381,
    "bộ": 382,
    "ẳ": 383,
    "dụ": 384,
    "ệu": 385,
    "mẹ": 386,
    "ếp": 387,
    "ểu": 388,
    "di": 389,
    "bằ": 390,
    "mặ": 391,
    "ẳn": 392,
    "ởn": 393,
    "lớ": 394,
    "ỗi": 395,
    "ọi": 396,
    "mi": 397,
    "bắ": 398,
    "mắ": 399,
    "lý": 400,
    "hò": 401,
    "ễn": 402,
    "đà": 403,
    "hĩ": 404,
    "mấ": 405,
    "óc": 406,
    "ừa": 407,
    "ịc": 408,
    "nữ": 409,
    "út": 410,
    "tà": 411,
    "bu": 412,
    "lú": 413,
    "im": 414,
    "tế": 415,
    "dư": 416,
    "hẳ": 417,
    "tấ": 418,
    "rẻ": 419,
    "kế": 420,
    "ấu": 421,
    "ầy": 422,
    "iờ": 423,
    "ga": 424,
    "dà": 425,
    "dự": 426,
    "đô": 427,
    "dù": 428,
    "ửa": 429,
    "cù": 430,
    "yề": 431,
    "uấ": 432,
    "ệp": 433,
    "iễ": 434,
    "ắm": 435,
    "oá": 436,
    "đố": 437,
    "áy": 438,
    "ợp": 439,
    "ệm": 440,
    "lầ": 441,
    "cư": 442,
    "bệ": 443,
    "tự": 444,
    "mạ": 445,
    "ỹ": 446,
    "la": 447,
    "tậ": 448,
    "đặ": 449,
    "hê": 450,
    "đứ": 451,
    "du": 452,
    "hẩ": 453,
    "àu": 454,
    "su": 455,
    "vụ": 456,
    "bê": 457,
    "hé": 458,
    "hệ": 459,
    "gá": 460,
    "hă": 461,
    "ỡ": 462,
    "ui": 463,
    "rằ": 464,
    "ìm": 465,
    "õ": 466,
    "ầm": 467,
    "gọ": 468,
    "vấ": 469,
    "mọ": 470,
    "ếc": 471,
    "uồ": 472,
    "bì": 473,
    "cà": 474,
    "rọ": 475,
    "uổ": 476,
    "rì": 477,
    "cấ": 478,
    "en": 479,
    "ẩn": 480,
    "hã": 481,
    "iữ": 482,
    "yể": 483,
    "bấ": 484,
    "ặn": 485,
    "tớ": 486,
    "ẹp": 487,
    "xa": 488,
    "bó": 489,
    "vừ": 490,
    "da": 491,
    "sả": 492,
    "ét": 493,
    "rở": 494,
    "gâ": 495,
    "ạm": 496,
    "ỉn": 497,
    "ậu": 498,
    "mỗ": 499,
    "bé": 500,
    "đổ": 501,
    "vă": 502,
    "nộ": 503,
    "ẩm": 504,
    "đì": 505,
    "ổn": 506,
    "đo": 507,
    "rả": 508,
    "ạy": 509,
    "ni": 510,
    "lờ": 511,
    "đờ": 512,
    "ấm": 513,
    "sứ": 514,
    "gầ": 515,
    "dị": 516,
    "lắ": 517,
    "ặp": 518,
    "cử": 519,
    "ãn": 520,
    "tụ": 521,
    "tổ": 522,
    "hớ": 523,
    "xi": 524,
    "lò": 525,
    "hù": 526,
    "uầ": 527,
    "mù": 528,
    "sĩ": 529,
    "lự": 530,
    "lấ": 531,
    "sử": 532,
    "iớ": 533,
    "oả": 534,
    "mố": 535,
    "hằ": 536,
    "mô": 537,
    "ôm": 538,
    "nơ": 539,
    "so": 540,
    "ợi": 541,
    "rạ": 542,
    "hổ": 543,
    "dạ": 544,
    "hề": 545,
    "gặ": 546,
    "óa": 547,
    "ếm": 548,
    "rà": 549,
    "bỏ": 550,
    "ởi": 551,
    "vị": 552,
    "ãi": 553,
    "ùa": 554,
    "ãy": 555,
    "xã": 556,
    "uê": 557,
    "ít": 558,
    "đủ": 559,
    "úp": 560,
    "rị": 561,
    "sâ": 562,
    "tă": 563,
    "gồ": 564,
    "oặ": 565,
    "lâ": 566,
    "ắp": 567,
    "cổ": 568,
    "cố": 569,
    "sơ": 570,
    "lậ": 571,
    "ằm": 572,
    "ép": 573,
    "ỳ": 574,
    "rờ": 575,
    "hè": 576,
    "lă": 577,
    "đẹ": 578,
    "vư": 579,
    "ưu": 580,
    "ứa": 581,
    "sắ": 582,
    "vu": 583,
    "gó": 584,
    "vợ": 585,
    "hẹ": 586,
    "iú": 587,
    "đọ": 588,
    "mỹ": 589,
    "cụ": 590,
    "ợt": 591,
    "lá": 592,
    "gắ": 593,
    "ía": 594,
    "ĩa": 595,
    "vô": 596,
    "ịu": 597,
    "ậm": 598,
    "mó": 599
  },
  "words": {
    "__pad": 0,
    "__unk": 1,
    "__blank": 2
  },
  "kwargs": {
    "vocab_size": 600,
    "pct_bpe": 1,
    "silent": true,
    "ngram_min": 2,
    "ngram_max": 2,
    "required_tokens": [
      "__pad",
      "__unk",
      "__blank"
    ],
    "strict": false,
    "EOW": "__eow",
    "SOW": "__sow",
    "UNK": "__unk",
    "PAD": "__pad"
  }
}